# ✔ Самостоятельно сохраните в переменной строку текста.
# ✔ Создайте из строки словарь, где ключ — буква, а значение — код буквы.
# ✔ Напишите преобразование в одну строку.


text = 'Это наш текст. Мы его преобразуем в словарь.'
dictionary = {i: ord(i) for i in text}
print(dictionary)

# ✔ Продолжаем развивать задачу 2.
# ✔ Возьмите словарь, который вы получили.
# Сохраните его итераторатор.
# ✔ Далее выведите первые 5 пар ключ-значение,
# обращаясь к итератору, а не к словарю.

iter_dict = iter(dictionary.items())
for _ in range(5):
    print(next(iter_dict))