# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.
a = 10
b = 3.5
c = [1,2,3,4,5]
d = 'Hello'

print(type(a), type(b), type(c), type(d))